openfoam/cow_mr_cfd/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | cow_mr_cfd — Circle of Willis MR, steady-state
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Kinematic pressure p/rho  [m²/s²]
// (incompressible solver — simpleFoam works with p/rho not Pa)

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    // ── Inlets: zeroGradient on pressure ──────────────────────────────────
    inlet_BA
    {
        type    zeroGradient;
    }
    inlet_R_ICA
    {
        type    zeroGradient;
    }
    inlet_L_ICA
    {
        type    zeroGradient;
    }

    // ── Outlets: fixedValue p=0 (relative reference) ──────────────────────
    outlet_R_PCA
    {
        type    fixedValue;
        value   uniform 0;
    }
    outlet_L_PCA
    {
        type    fixedValue;
        value   uniform 0;
    }
    outlet_L_MCA
    {
        type    fixedValue;
        value   uniform 0;
    }
    outlet_R_ACA
    {
        type    fixedValue;
        value   uniform 0;
    }
    outlet_L_ACA
    {
        type    fixedValue;
        value   uniform 0;
    }

    // ── Wall: zeroGradient ────────────────────────────────────────────────
    wall
    {
        type    zeroGradient;
    }

    // ── Background box faces (not physical — should not exist after sHM) ──
    domain_walls
    {
        type    zeroGradient;
    }
}

// ************************************************************************* //
