openfoam/cow_mr_cfd/0/thickness
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thickness;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 0;

boundaryField
{
    domain_walls
    {
        type            fixedValue;
        value           uniform 0;
    }
    wall
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
86136
(
0
0
0
0
0
0
0
0
...
)
;
    }
    inlet_BA
    {
        type            fixedValue;
        value           uniform 0;
    }
    inlet_R_ICA
    {
        type            fixedValue;
        value           uniform 0;
    }
    inlet_L_ICA
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet_R_PCA
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet_L_PCA
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet_L_MCA
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet_R_ACA
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet_L_ACA
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
