openfoam/cow_mr_cfd/Allrun
#!/bin/bash
# Allrun — Full CFD pipeline for Circle of Willis (MR, steady-state)
# ──────────────────────────────────────────────────────────────────
# Step 0: Run scripts/01_cap_surface.py first (once, outside this script) to
#         generate the STL files in constant/triSurface/.
#
# Usage:
#   cd openfoam/cow_mr_cfd
#   ./Allrun        # serial run
#   ./Allrun -par   # parallel run (4 cores, as set in decomposeParDict)
#
# Requirements:
#   - OpenFOAM (dev) sourced in the current shell
#   - STL files present in constant/triSurface/

set -e   # exit on first error

cd "${0%/*}" || exit 1    # run from case directory

# Source OpenFOAM if not already sourced
if [ -z "$WM_PROJECT" ]; then
    source /opt/openfoam-dev/etc/bashrc
fi

PARALLEL=false
if [ "$1" = "-par" ]; then PARALLEL=true; fi

echo "=================================================="
echo " CoW MR CFD Case — OpenFOAM $WM_PROJECT_VERSION"
echo "=================================================="

# ── Step 1: Generate surface feature edges ────────────────────────────────────
echo ""
echo ">>> Step 1: surfaceFeatures"
surfaceFeatures 2>&1 | tee log.surfaceFeatures

# ── Step 2: blockMesh — background Cartesian grid ─────────────────────────────
echo ""
echo ">>> Step 2: blockMesh"
blockMesh 2>&1 | tee log.blockMesh

# ── Step 3: snappyHexMesh — snap to vessel surface and add layers ─────────────
echo ""
echo ">>> Step 3: snappyHexMesh"
if $PARALLEL; then
    decomposePar -force 2>&1 | tee log.decomposePar
    mpirun -np 4 snappyHexMesh -parallel -overwrite 2>&1 | tee log.snappyHexMesh
    reconstructParMesh -constant 2>&1 | tee log.reconstructParMesh
    rm -rf processor*/
else
    snappyHexMesh -overwrite 2>&1 | tee log.snappyHexMesh
fi

# ── Step 4: Check mesh quality ────────────────────────────────────────────────
echo ""
echo ">>> Step 4: checkMesh"
checkMesh 2>&1 | tee log.checkMesh

# ── Step 5: Rename 0/orig if needed and copy IC ────────────────────────────────
# (The initial 0/ directory is kept as-is; snappyHexMesh writes the mesh into
#  constant/polyMesh at t=0)

# ── Step 6: simpleFoam ────────────────────────────────────────────────────────
echo ""
echo ">>> Step 6: simpleFoam (steady-state)"
if $PARALLEL; then
    decomposePar -force 2>&1 | tee log.decomposePar_solver
    mpirun -np 4 simpleFoam -parallel 2>&1 | tee log.simpleFoam
    reconstructPar -latestTime 2>&1 | tee log.reconstructPar
    rm -rf processor*/
else
    simpleFoam 2>&1 | tee log.simpleFoam
fi

echo ""
echo "=================================================="
echo " Done.  Results in the latest time directory."
echo " Visualise with:  paraFoam  or  paraview"
echo "=================================================="
