openfoam/cow_mr_cfd/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    domain_walls
    {
        type            patch;
        nFaces          26505;
        startFace       2183643;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          86136;
        startFace       2210148;
    }
    inlet_BA
    {
        type            patch;
        nFaces          1090;
        startFace       2296284;
    }
    inlet_R_ICA
    {
        type            patch;
        nFaces          2565;
        startFace       2297374;
    }
    inlet_L_ICA
    {
        type            patch;
        nFaces          349;
        startFace       2299939;
    }
    outlet_R_PCA
    {
        type            patch;
        nFaces          132;
        startFace       2300288;
    }
    outlet_L_PCA
    {
        type            patch;
        nFaces          204;
        startFace       2300420;
    }
    outlet_L_MCA
    {
        type            patch;
        nFaces          388;
        startFace       2300624;
    }
    outlet_R_ACA
    {
        type            patch;
        nFaces          337;
        startFace       2301012;
    }
    outlet_L_ACA
    {
        type            patch;
        nFaces          158;
        startFace       2301349;
    }
)

// ************************************************************************* //
