openfoam/cow_mr_cfd/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | cow_mr_cfd — Circle of Willis MR, steady-state
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Newtonian blood model
//   Dynamic viscosity   μ = 3.5 × 10⁻³ Pa·s
//   Density             ρ = 1060 kg/m³
//   Kinematic viscosity ν = μ/ρ = 3.302 × 10⁻⁶ m²/s

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0]  3.302e-6;

// ************************************************************************* //
