openfoam/cow_mr_cfd/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | cow_mr_cfd — Circle of Willis MR, steady-state
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Background bounding box for snappyHexMesh.
// MR mesh bounds: x[-38.2,23.8] y[-40.7,5.7] z[-19.8,21.7] mm  → m + 20% margin
//   xMin = -0.050  xMax = 0.032
//   yMin = -0.052  yMax = 0.012
//   zMin = -0.028  zMax = 0.030

scale   1;   // metres

vertices
(
    (-0.050 -0.052 -0.028)   // 0
    ( 0.032 -0.052 -0.028)   // 1
    ( 0.032  0.012 -0.028)   // 2
    (-0.050  0.012 -0.028)   // 3
    (-0.050 -0.052  0.030)   // 4
    ( 0.032 -0.052  0.030)   // 5
    ( 0.032  0.012  0.030)   // 6
    (-0.050  0.012  0.030)   // 7
);

blocks
(
    // 4 mm background cells (0.004 m)
    // Lx=0.082 → 21 cells, Ly=0.064 → 16 cells, Lz=0.058 → 15 cells
    hex (0 1 2 3 4 5 6 7) (21 16 15) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    domain_walls
    {
        type    patch;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (0 1 5 4)
            (2 3 7 6)
            (0 4 7 3)
            (1 2 6 5)
        );
    }
);

// ************************************************************************* //
