openfoam/cow_mr_cfd/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | cow_mr_cfd — Circle of Willis MR, steady-state
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Extract feature edges from each STL patch for explicit feature snapping in
// snappyHexMesh.

wall.stl        { extractionMethod extractFromSurface; includedAngle 150; }
inlet_BA.stl    { extractionMethod extractFromSurface; includedAngle 150; }
inlet_R_ICA.stl { extractionMethod extractFromSurface; includedAngle 150; }
inlet_L_ICA.stl { extractionMethod extractFromSurface; includedAngle 150; }
outlet_R_PCA.stl { extractionMethod extractFromSurface; includedAngle 150; }
outlet_L_PCA.stl { extractionMethod extractFromSurface; includedAngle 150; }
outlet_L_MCA.stl { extractionMethod extractFromSurface; includedAngle 150; }
outlet_R_ACA.stl { extractionMethod extractFromSurface; includedAngle 150; }
outlet_L_ACA.stl { extractionMethod extractFromSurface; includedAngle 150; }

// ************************************************************************* //
